# Rebar Bend Data Bar Nominal Diameter Property

Source: https://www.revitapidocs.com/2026/4af85f50-5725-36fb-dedc-972639ed4c5c.htm

---

| Rebar Bend Data Bar Nominal Diameter Property |
| --- |

Defines the nominal diameter of the bar.
 The default value is 0\.0\.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double BarNominalDiameter { get; set; }
```

```
Public Property BarNominalDiameter As Double
	Get
	Set
```

```
public:
property double BarNominalDiameter {
	double get ();
	void set (double value);
}
```

```
member BarNominalDiameter : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for barNominalDiameter is not finite |

See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace